## replace方法

In [1]:
from pydataset import data

titanic = data('titanic')

titanic.head()

       class     age  sex survived
1  1st class  adults  man      yes
2  1st class  adults  man      yes
3  1st class  adults  man      yes
4  1st class  adults  man      yes
5  1st class  adults  man      yes

In [4]:
titanic.sex.replace(['man', 'women'], [1, 0])

1       1
2       1
3       1
4       1
5       1
       ..
1312    0
1313    0
1314    0
1315    0
1316    0
Name: sex, Length: 1316, dtype: int64

## map方法

In [5]:
titanic.sex.map(dict(women=0, man=1))

1       1
2       1
3       1
4       1
5       1
       ..
1312    0
1313    0
1314    0
1315    0
1316    0
Name: sex, Length: 1316, dtype: int64

## LabelEncoder方法

In [6]:
from sklearn.preprocessing import LabelEncoder

### 单列

In [7]:
le = LabelEncoder()
le.fit(titanic.survived)
le.transform(titanic.survived)

array([1, 1, 1, ..., 0, 0, 0])

### 所有列

In [8]:
titanic.apply(LabelEncoder().fit_transform)

      class  age  sex  survived
1         0    0    0         1
2         0    0    0         1
3         0    0    0         1
4         0    0    0         1
5         0    0    0         1
...     ...  ...  ...       ...
1312      2    1    1         0
1313      2    1    1         0
1314      2    1    1         0
1315      2    1    1         0
1316      2    1    1         0

[1316 rows x 4 columns]